/* Всі однакові ключі заміняються правішими об'єктами, a: 2 правіше, тоді його значення перепише a: 1 */
Object.assign({ a: 1, b: 2 }, { a: 2, c: 4 }, { y: 1 });
// {a: 2, b: 2, c: 4, y: 1}
/* І додаються нові значення, яких немає в першому об'єкті. Вона все змержить в один об'єкт. */
/* Повертає новий об'єкт. Глибока копія. */

let e = {
  d: 2
};
let f = Object.assign({}, e);
console.log(f);

f.e = 5;
console.log(e);
/* Щоб не змінювати вхідні данні. Зберігається початкове значення. */

/* або це можна зробити через spred оператор ... Таким чином можна повністю скопіювати об'єкт. */
let g = { ...e };
console.log(e);

/* Повертає з ключами об'єкт */
Object.keys({ a: 1, b: 2 });
/* ["a", "b"] */

/* Повертає значення */
Object.values({ a: 1, b: 2 });
/* [1, 2] */
